In [3]:
import numpy as np
import pandas as pd
df1={
    'Name':['George','Andrea','micheal','maggie','Ravi','Xien','Jalpa',np.nan],
    'State':['Arizona','Georgia','Newyork','Indiana','Florida','Clifornia',np.nan,np.nan],
    'Gender':['M','F','M','F','M','M',np.nan,np.nan],
    'Score':[63,48,56,75,np.nan,77,np.nan,np.nan]
}

df1=pd.DataFrame(df1,columns=['Name','State','Gender','Score'])
display(df1)

      Name      State Gender  Score
0   George    Arizona      M   63.0
1   Andrea    Georgia      F   48.0
2  micheal    Newyork      M   56.0
3   maggie    Indiana      F   75.0
4     Ravi    Florida      M    NaN
5     Xien  Clifornia      M   77.0
6    Jalpa        NaN    NaN    NaN
7      NaN        NaN    NaN    NaN

In [4]:
df1.to_csv('df1.csv')

In [6]:
display(df1.tail())

#display(df1.dropna())

     Name      State Gender  Score
3  maggie    Indiana      F   75.0
4    Ravi    Florida      M    NaN
5    Xien  Clifornia      M   77.0
6   Jalpa        NaN    NaN    NaN
7     NaN        NaN    NaN    NaN

In [7]:
display(df1.dropna())

      Name      State Gender  Score
0   George    Arizona      M   63.0
1   Andrea    Georgia      F   48.0
2  micheal    Newyork      M   56.0
3   maggie    Indiana      F   75.0
5     Xien  Clifornia      M   77.0

In [8]:
display(df1)

      Name      State Gender  Score
0   George    Arizona      M   63.0
1   Andrea    Georgia      F   48.0
2  micheal    Newyork      M   56.0
3   maggie    Indiana      F   75.0
4     Ravi    Florida      M    NaN
5     Xien  Clifornia      M   77.0
6    Jalpa        NaN    NaN    NaN
7      NaN        NaN    NaN    NaN

In [9]:
display(df1.fillna(0))
print("inplace=false: dont modify original data")
display(df1)

      Name      State Gender  Score
0   George    Arizona      M   63.0
1   Andrea    Georgia      F   48.0
2  micheal    Newyork      M   56.0
3   maggie    Indiana      F   75.0
4     Ravi    Florida      M    0.0
5     Xien  Clifornia      M   77.0
6    Jalpa          0      0    0.0
7        0          0      0    0.0

      Name      State Gender  Score
0   George    Arizona      M   63.0
1   Andrea    Georgia      F   48.0
2  micheal    Newyork      M   56.0
3   maggie    Indiana      F   75.0
4     Ravi    Florida      M    NaN
5     Xien  Clifornia      M   77.0
6    Jalpa        NaN    NaN    NaN
7      NaN        NaN    NaN    NaN

In [10]:
df1=df1.fillna(0)
display(df1)

      Name      State Gender  Score
0   George    Arizona      M   63.0
1   Andrea    Georgia      F   48.0
2  micheal    Newyork      M   56.0
3   maggie    Indiana      F   75.0
4     Ravi    Florida      M    0.0
5     Xien  Clifornia      M   77.0
6    Jalpa          0      0    0.0
7        0          0      0    0.0

In [12]:
df1.fillna(df1.select_dtypes(include=['number']).mean(), inplace=True)
display(df1)

      Name      State Gender  Score
0   George    Arizona      M   63.0
1   Andrea    Georgia      F   48.0
2  micheal    Newyork      M   56.0
3   maggie    Indiana      F   75.0
4     Ravi    Florida      M    0.0
5     Xien  Clifornia      M   77.0
6    Jalpa          0      0    0.0
7        0          0      0    0.0

In [16]:
data={
    'Name':['Alice','Bob','Chrlie','David',None],
    'Age':[25,np.nan,30,35,40],
    'Score':[85,90,np.nan,88,92], 
    'City':['New York','Los Angel',None, 'Chicago','Houston']
}
df=pd.DataFrame(data)
#data=pd.DataFrame(data,columns=['Name','Age','Score','City'])
display(df)

     Name   Age  Score       City
0   Alice  25.0   85.0   New York
1     Bob   NaN   90.0  Los Angel
2  Chrlie  30.0    NaN       None
3   David  35.0   88.0    Chicago
4    None  40.0   92.0    Houston

In [17]:
print("Misisng val count")
display(df.isnull().sum())

Misisng val count

Name     1
Age      1
Score    1
City     1
dtype: int64

In [18]:
df_drop_rows=df.dropna()
print('after dropping row with missing value')
display(df_drop_rows)

after dropping row with missing value

    Name   Age  Score      City
0  Alice  25.0   85.0  New York
3  David  35.0   88.0   Chicago

In [21]:
df_drop_cols=df.dropna(axis=1)
print('after dropping cols with missing value')
print(df_drop_cols,"\n")

after dropping cols with missing value
Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [23]:
df_fill_mean=df.copy()
df_fill_mean['Age']= df_fill_mean['Age'].fillna(df['Age'].mean())
df_fill_mean['Score']= df_fill_mean['Score'].fillna(df['Score'].mean())
print('after fillin numeric cols with mena')
display(df_fill_mean)

after fillin numeric cols with mena

     Name   Age  Score       City
0   Alice  25.0  85.00   New York
1     Bob  32.5  90.00  Los Angel
2  Chrlie  30.0  88.75       None
3   David  35.0  88.00    Chicago
4    None  40.0  92.00    Houston

In [25]:
#drop column with mor ethan 20% null

nan_percentages=df.isnull().sum()/len(df)
cols_to_drop=nan_percentages[nan_percentages>.60].index
df_clean=df.drop(columns=cols_to_drop)
display(df_clean)

     Name   Age  Score       City
0   Alice  25.0   85.0   New York
1     Bob   NaN   90.0  Los Angel
2  Chrlie  30.0    NaN       None
3   David  35.0   88.0    Chicago
4    None  40.0   92.0    Houston

In [28]:
df_fill_value=df.fillna({'Name':'Unknown', 'City':'Unknown','Age':0 , 'Score':0})
print("after filling With specific values")
display(df_fill_value)

after filling With specific values

      Name   Age  Score       City
0    Alice  25.0   85.0   New York
1      Bob   0.0   90.0  Los Angel
2   Chrlie  30.0    0.0    Unknown
3    David  35.0   88.0    Chicago
4  Unknown  40.0   92.0    Houston

In [30]:
#FORWARD FILL 

df_ffill=df.ffill()
print("after forward fill")
display(df_ffill)

after forward fill

     Name   Age  Score       City
0   Alice  25.0   85.0   New York
1     Bob  25.0   90.0  Los Angel
2  Chrlie  30.0   90.0  Los Angel
3   David  35.0   88.0    Chicago
4   David  40.0   92.0    Houston

In [31]:
df_bfill=df.bfill()
print("after backward fill")
display(df_bfill)

after backward fill

     Name   Age  Score       City
0   Alice  25.0   85.0   New York
1     Bob  30.0   90.0  Los Angel
2  Chrlie  30.0   88.0    Chicago
3   David  35.0   88.0    Chicago
4    None  40.0   92.0    Houston

In [32]:
df_fill_mode= df.copy()
df_fill_mode['City']= df_fill_mode['City'].fillna(df['City'].mode()[0])
print('After filling categprical columns with mode:')
display(df_fill_mode)

After filling categprical columns with mode:

     Name   Age  Score       City
0   Alice  25.0   85.0   New York
1     Bob   NaN   90.0  Los Angel
2  Chrlie  30.0    NaN    Chicago
3   David  35.0   88.0    Chicago
4    None  40.0   92.0    Houston

In [33]:
!echo Python Version:
!python --version

Python Version:
Python 3.13.5